#include <stdio.h>

int main(void)
{
	int a,b;
	printf("=================================\n");
	printf("메뉴선정을 시작하겠습니다.\n");
	printf("=================================\n");
	printf("시작은 1번, 종료는 2번\n");
	scanf_s("%d", &a);

	if (a==1)
	{
		printf("메뉴선정에 오신것을 환영합니다\n");
		printf("======================================\n");
		printf("Round 1\n");
		printf("짜장면 VS 짬뽕\n");
		printf("======================================\n");
		printf("짜장면----1번\n");
		printf("짬뽕----2번\n");
		scanf_s("%d", &b);

		if (b==1)
		{
			printf("=====================================================================\n");
			printf("짜장면 한 그릇의 칼로리는 797kcal\n");
			printf("당신이 포기하신 짬뽕 칼로리의 2배....\n");
			printf("지금 당신은 돼지군요!\n");
			printf("=====================================================================\n");
		}
		else
		{
			printf("=====================================================================\n");
			printf("짬뽕을 좋아하는 당신 짜장면을 좋아하는 분보다 살이 덜 찌셨군요\n");
			printf("앞으로 더 많이 섭취하셔서 돼지가 되세요^^!\n");
			printf("=====================================================================\n");
		}
	}
	else
	{
		printf("=====================================================================\n");
		printf("종료되었습니다\n");
		printf("=====================================================================\n");
	}
	
	return 0;
}